# Họ tên: Nguyễn Vũ Hải
# Lớp: CNTT K18 CLC
# Mã SV: DTC195480201CLC0006

Bài 1. Hãy tạo 1 bảng có tên "company" trong database "testdb.db" với các trường thông tin (id: int; name: text; product_id: int; country: text)

In [27]:
#importing libraries
import pandas as pd
import sqlite3
import numpy as np

In [2]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Collecting sqlparse
  Downloading sqlparse-0.4.3-py3-none-any.whl (42 kB)
     ---------------------------------------- 42.8/42.8 kB 1.0 MB/s eta 0:00:00
Requirement already satisfied: ipython-genutils in d:\anaconda3\envs\nlp\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in d:\anaconda3\envs\nlp\lib\site-packages (from ipython-sql) (8.4.0)
Collecting prettytable
  Downloading prettytable-3.6.0-py3-none-any.whl (27 kB)
Requirement already satisfied: six in d:\anaconda3\envs\nlp\lib\site-packages (from ipython-sql) (1.16.0)
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.5.post1-cp39-cp39-win_amd64.whl (2.0 MB)
     ---------------------------------------- 2.0/2.0 MB 4.6 MB/s eta 0:00:00
Collecting greenlet!=0.4.17
  Downloading greenlet-2.0.2-cp39-cp39-win_amd64.whl (192 kB)
     -------------------------------------- 192.1/192.1 kB 5.9 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in d:\anaconda3\envs\nlp\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: jedi>=0.16 in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: colorama in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: backcall in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pygments>=2.4.0 in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: matplotlib-inline in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: traitlets>=5 in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: setuptools>=18.5 in d:\anaconda3\envs\nlp\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: wcwidth in d:\anaconda3\envs\nlp\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in d:\anaconda3\envs\nlp\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in d:\anaconda3\envs\nlp\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in d:\anaconda3\envs\nlp\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing in d:\anaconda3\envs\nlp\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Installing collected packages: sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-2.0.2 ipython-sql-0.5.0 prettytable-3.6.0 sqlalchemy-2.0.5.post1 sqlparse-0.4.3

In [3]:
#Connecting sqlite3 and creating a Database
conn1 = sqlite3.connect("testdb.db")

In [4]:
company_df = pd.DataFrame(columns=["id", "name", "product_id", "country"])
company_df

Empty DataFrame
Columns: [id, name, product_id, country]
Index: []

In [5]:
company_df.to_sql("company", conn1, index=False, if_exists="replace")

0

In [12]:
# Loading the sql module to ipython using line magic
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [13]:
%sql sqlite:///testdb.db

In [14]:
# Using magic line %sql  to switch to sql syntax (CRUD operations)
%sql SELECT * FROM company LIMIT 20;

 * sqlite:///testdb.db
Done.

[]

Bài 2. Hãy thêm 3 thực thể (entity) vào bảng có tên "company" trong database "testdb.db";

In [20]:
sqlCommand1 = "INSERT INTO company (id, name, product_id, country) VALUES (?, ?, ?, ?);"
listSQL1 = [
    (1, 'Chair', 1, "Vietnam"), 
    (2, 'Computer', 2, "Vietnam"), 
    (3, 'Toothbrush', 3, "Vietnam"),
]
cursor1 = conn1.cursor()
cursor1.executemany(sqlCommand1, listSQL1)
conn1.commit()

In [21]:
%sql SELECT * FROM company LIMIT 20;

 * sqlite:///testdb.db
Done.

[('1', 'Chair', '1', 'Vietnam'),
 ('2', 'Computer', '2', 'Vietnam'),
 ('3', 'Toothbrush', '3', 'Vietnam')]

Bài 3. Tạo 1 database có tên "testdb2"

In [29]:
conn2 = sqlite3.connect("testdb2.db")

Bài 4.Hãy đọc file `salaries.csv` vào pandas dataframe. Tải dataframe vào database "`testdb2`" và đặt tên bảng `salaries_tab`.

In [28]:
df_salary = pd.read_csv("Salaries.csv")
df_salary.BasePay = pd.to_numeric(df_salary.BasePay, errors='coerce')
df_salary.OvertimePay = pd.to_numeric(df_salary.OvertimePay, errors='coerce')
df_salary.TotalPayBenefits = pd.to_numeric(df_salary.TotalPayBenefits, errors='coerce')
df_salary = df_salary.replace(np.nan,0)
df_salary.head()

C:\Users\mamto\AppData\Local\Temp\ipykernel_19856\62089567.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df_salary = pd.read_csv("Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0,567595.43,567595.43,2011,0.0,San Francisco,0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0,538909.28,538909.28,2011,0.0,San Francisco,0
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,0,335279.91,335279.91,2011,0.0,San Francisco,0
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,0,332343.61,332343.61,2011,0.0,San Francisco,0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0,326373.19,326373.19,2011,0.0,San Francisco,0

In [30]:
df_salary.to_sql("salaries_tab", conn2, index=False, if_exists="replace")

148654

Bài 5. Xem 10 hàng đầu tiên của bảng `salaries_tab`

In [31]:
# Loading the sql module to ipython using line magic
%load_ext sql
%sql sqlite:///testdb2.db
%sql SELECT * FROM salaries_tab LIMIT 10;

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
   sqlite:///testdb.db
 * sqlite:///testdb2.db
Done.

[(1, 'NATHANIEL FORD', 'GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY', 167411.18, 0.0, '400184.25', '0', 567595.43, 567595.43, 2011, 0.0, 'San Francisco', '0'),
 (2, 'GARY JIMENEZ', 'CAPTAIN III (POLICE DEPARTMENT)', 155966.02, 245131.88, '137811.38', '0', 538909.28, 538909.28, 2011, 0.0, 'San Francisco', '0'),
 (3, 'ALBERT PARDINI', 'CAPTAIN III (POLICE DEPARTMENT)', 212739.13, 106088.18, '16452.6', '0', 335279.91, 335279.91, 2011, 0.0, 'San Francisco', '0'),
 (4, 'CHRISTOPHER CHONG', 'WIRE ROPE CABLE MAINTENANCE MECHANIC', 77916.0, 56120.71, '198306.9', '0', 332343.61, 332343.61, 2011, 0.0, 'San Francisco', '0'),
 (5, 'PATRICK GARDNER', 'DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)', 134401.6, 9737.0, '182234.59', '0', 326373.19, 326373.19, 2011, 0.0, 'San Francisco', '0'),
 (6, 'DAVID SULLIVAN', 'ASSISTANT DEPUTY CHIEF II', 118602.0, 8601.0, '189082.74', '0', 316285.74, 316285.74, 2011, 0.0, 'San Francisco', '0'),
 (7, 'ALSON LEE', 'BATTALION CHIEF, (FIRE DEPARTMENT)', 92492.01, 89062.9, '134426.14', '0', 315981.05, 315981.05, 2011, 0.0, 'San Francisco', '0'),
 (8, 'DAVID KUSHNER', 'DEPUTY DIRECTOR OF INVESTMENTS', 256576.96, 0.0, '51322.5', '0', 307899.46, 307899.46, 2011, 0.0, 'San Francisco', '0'),
 (9, 'MICHAEL MORRIS', 'BATTALION CHIEF, (FIRE DEPARTMENT)', 176932.64, 86362.68, '40132.23', '0', 303427.55, 303427.55, 2011, 0.0, 'San Francisco', '0'),
 (10, 'JOANNE HAYES-WHITE', 'CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)', 285262.0, 0.0, '17115.73', '0', 302377.73, 302377.73, 2011, 0.0, 'San Francisco', '0')]

Bài 6. 
a. Hãy hiển thị thông tin Họ tên, nghề nghiệp của những nhân viên có mức lương cơ bản (BasePay) trên 200000. 

b. Hãy lưu thông tin Họ tên, nghề nghiệp, tên công ty (agency) của 100 nhân viên có mức lương tổng (TotalPayBenefits) cao nhất vào biến cục bộ `saved_results` và đọc kết quả về file `saved_results.csv`

In [32]:
 %sql result << SELECT * FROM salaries_tab WHERE BasePay >= 200000;

   sqlite:///testdb.db
 * sqlite:///testdb2.db
Done.
Returning data to local variable result

In [34]:
result = pd.DataFrame(result)

In [36]:
result.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,0,335279.91,335279.91,2011,0.0,San Francisco,0
1,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.5,0,307899.46,307899.46,2011,0.0,San Francisco,0
2,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,0,302377.73,302377.73,2011,0.0,San Francisco,0
3,13,EDWARD HARRINGTON,EXECUTIVE CONTRACT EMPLOYEE,294580.02,0.00,0.0,0,294580.02,294580.02,2011,0.0,San Francisco,0
4,14,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,0,292671.62,292671.62,2011,0.0,San Francisco,0

In [37]:
 %sql result2 << SELECT * FROM salaries_tab ORDER BY TotalPayBenefits DESC LIMIT 100

   sqlite:///testdb.db
 * sqlite:///testdb2.db
Done.
Returning data to local variable result2

In [38]:
result2 = pd.DataFrame(result2)

In [42]:
result2.to_csv("saved_results.csv")
result2.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0,567595.43,567595.43,2011,0.0,San Francisco,0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0,538909.28,538909.28,2011,0.0,San Francisco,0
2,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,0.0,San Francisco,PT
3,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,0.0,San Francisco,FT
4,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.7,96570.66,339653.70,436224.36,2014,0.0,San Francisco,PT

Bài 7. Hãy đọc kết quả của truy vấn sql các thông tin Họ tên, nghề nghiệp, công ty của những nhân viên có mức lương tổng(TotalPayBenefits) dưới 100000 và lưu vào Pandas dataframe.
Hiển thị 5 dòng đầu của dataframe đó và đếm số lượng nhân viên.

In [54]:
 %sql result3 << SELECT EmployeeName, JobTitle, Agency, TotalPayBenefits FROM salaries_tab WHERE TotalPayBenefits <= 100000

   sqlite:///testdb.db
 * sqlite:///testdb2.db
Done.
Returning data to local variable result3

In [60]:
result3 = pd.DataFrame(result3)

In [63]:
print(f"Số lượng nhân viên là: {result3.shape[0]}")
result3.head(5)

Số lượng nhân viên là: 81585

,EmployeeName,JobTitle,Agency,TotalPayBenefits
0,ERIKA KIEFER,REGISTERED NURSE,San Francisco,99983.35
1,GREGORY DORAIS,ELECTRONIC MAINTENANCE TECHNICIAN,San Francisco,99982.16
2,GRACE ENRIQUEZ,IS ADMINISTRATOR III,San Francisco,99962.70
3,RONALD SHEREDY,PHYSICAL THERAPIST,San Francisco,99961.59
4,MARY GODFREY,OCCUPATIONAL THERAPIST,San Francisco,99961.33